#rating = int(input('Введите место в списке поступающих: '))
#if rating >= 1 and rating <= 10:
 # quantity_points = int(input('Введите количество баллов за экзамены: '))
  #if quantity_points >= 290:
 #   print('Поздравляем, вы поступили!')
 #   print('Бонусом вам будет начисляться стипендия.')
 # else:
 #   print('Поздравляем, вы поступили!')
 #   print('Но вам не хватило баллов для стипендии.')  
#else:
  #print('К сожалению, вы не поступили.')

  rating = int(input('Введите место в списке поступающих: '))
if rating >= 1 and rating <= 10:
  print('Поздравляем, вы поступили!')
  quantity_points = int(input('Введите количество баллов за экзамены: '))
  if quantity_points >= 290:
    print('Бонусом вам будет начисляться стипендия.')
  else:
    print('Но вам не хватило баллов для стипендии.')  
else:
  print('К сожалению, вы не поступили.')