print('Задание 2.')

print('Первый вариант')
print('===========================')
print('Привет')
print('Таня')
print('===========================')

print('Второй вариант')
print('============================')
print('||         Привет         ||')
print('||          Таня          ||')
print('============================')

print('Третий вариант')
print('=============================')
print('||                         ||')
print('||                         ||')
print('||         Привет,         ||')
print('||         Таня!           ||')
print('||                         ||')
print('||                         ||')
print('=============================')


